Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
module.kubernetes.module.grafana.helm_release.promtail: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # module.kubernetes.module.grafana.helm_release.loki will be destroyed
- resource "helm_release" "loki" {
      - atomic                     = false -> null
      - chart                      = "loki" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "loki" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "2.9.2"
              - chart       = "loki"
              - name        = "loki"
              - namespace   = "grafana"
              - revision    = 1
              - values      = jsonencode({})
              - version     = "5.35.0"
            },
        ] -> null
      - name                       = "loki" -> null
      - namespace                  = "grafana" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://grafana.github.io/helm-charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "failed" -> null
      - timeout                    = 300 -> null
      - values                     = [
          - "",
        ] -> null
      - verify                     = false -> null
      - version                    = "5.35.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # module.kubernetes.module.grafana.helm_release.promtail will be updated in-place
~ resource "helm_release" "promtail" {
        id                         = "promtail"
      ~ metadata                   = [
          - {
              - app_version = "2.9.2"
              - chart       = "promtail"
              - name        = "promtail"
              - namespace   = "grafana"
              - revision    = 3
              - values      = jsonencode(
                    {
                      - initContainer = {
                          - enabled                   = true
                          - fsInotifyMaxUserInstances = 512
                        }
                    }
                )
              - version     = "6.15.3"
            },
        ] -> (known after apply)
        name                       = "promtail"
      ~ status                     = "failed" -> "deployed"
      + values                     = [
          + <<-EOT
                initContainer:
                  enabled: true
                  fsInotifyMaxUserInstances: 512
            EOT,
        ]
        # (25 unchanged attributes hidden)
    }

  # module.kubernetes.module.storage-class.kubernetes_manifest.db-storage will be created
+ resource "kubernetes_manifest" "db-storage" {
      + manifest = {
          + apiVersion        = "storage.k8s.io/v1"
          + kind              = "StorageClass"
          + metadata          = {
              + name = "db-storage"
            }
          + provisioner       = "k8s.io/minikube-hostpath"
          + reclaimPolicy     = "Delete"
          + volumeBindingMode = "Immediate"
        }
      + object   = {
          + allowVolumeExpansion = (known after apply)
          + allowedTopologies    = (known after apply)
          + apiVersion           = "storage.k8s.io/v1"
          + kind                 = "StorageClass"
          + metadata             = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "db-storage"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + mountOptions         = (known after apply)
          + parameters           = (known after apply)
          + provisioner          = "k8s.io/minikube-hostpath"
          + reclaimPolicy        = "Delete"
          + volumeBindingMode    = "Immediate"
        }
    }

  # module.kubernetes.module.storage-class.kubernetes_manifest.monitoring-storage will be created
+ resource "kubernetes_manifest" "monitoring-storage" {
      + manifest = {
          + apiVersion        = "storage.k8s.io/v1"
          + kind              = "StorageClass"
          + metadata          = {
              + name = "monitoring-storage"
            }
          + provisioner       = "k8s.io/minikube-hostpath"
          + reclaimPolicy     = "Delete"
          + volumeBindingMode = "Immediate"
        }
      + object   = {
          + allowVolumeExpansion = (known after apply)
          + allowedTopologies    = (known after apply)
          + apiVersion           = "storage.k8s.io/v1"
          + kind                 = "StorageClass"
          + metadata             = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "monitoring-storage"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + mountOptions         = (known after apply)
          + parameters           = (known after apply)
          + provisioner          = "k8s.io/minikube-hostpath"
          + reclaimPolicy        = "Delete"
          + volumeBindingMode    = "Immediate"
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production`
</details>
Plan: 2 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`